In [2]:
import pandas as pd
df=pd.read_csv("cse1.csv")
df

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [3]:
df.head()

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [4]:
df.tail()

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
NAME      5 non-null object
AGE       5 non-null int64
SALARY    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [6]:
df.describe()

             AGE         SALARY
count   5.000000       5.000000
mean   24.000000   60000.000000
std    12.922848   27156.951228
min    12.000000   35000.000000
25%    17.000000   40000.000000
50%    19.000000   50000.000000
75%    27.000000   75000.000000
max    45.000000  100000.000000

In [7]:
df.isnull()

    NAME    AGE  SALARY
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False

In [8]:
df.notnull()

   NAME   AGE  SALARY
0  True  True    True
1  True  True    True
2  True  True    True
3  True  True    True
4  True  True    True

In [9]:
df.isnull().sum()

NAME      0
AGE       0
SALARY    0
dtype: int64

In [10]:
df.notnull().sum()

NAME      5
AGE       5
SALARY    5
dtype: int64

In [13]:
null_name=pd.isnull(df["NAME"])

In [15]:
df[null_name]

Empty DataFrame
Columns: [NAME, AGE, SALARY]
Index: []

In [18]:
notnull_name=pd.notnull(df["NAME"])
df[notnull_name]

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [19]:
data=df
data.fillna(0)

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [20]:
data.fillna(0)

      NAME  AGE  SALARY
0     Ammu   19   50000
1     Gayu   17   75000
2  Pallavi   45  100000
3    Priya   12   35000
4    Malli   27   40000

In [22]:
data=pd.read_csv("cse1.csv")
data

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0       NaN
2  Pallavi  45.0  100000.0
3    Priya   NaN   35000.0
4    Malli  27.0   40000.0

In [23]:
data=pd.read_csv("cse1.csv")

In [26]:
data

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0       NaN
2  Pallavi  45.0  100000.0
3    Priya   NaN   35000.0
4    Malli  27.0   40000.0

In [27]:
d=pd.read_csv("cse1.csv")
d

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0       NaN
2  Pallavi  45.0  100000.0
3    Priya   NaN   35000.0
4    Malli  27.0   40000.0

In [28]:
d.fillna(0)

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0       0.0
2  Pallavi  45.0  100000.0
3    Priya   0.0   35000.0
4    Malli  27.0   40000.0

In [29]:
df.isnull().sum()

NAME      0
AGE       0
SALARY    0
dtype: int64

In [30]:
df1=d
df1.fillna(method="pad")

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0   50000.0
2  Pallavi  45.0  100000.0
3    Priya  45.0   35000.0
4    Malli  27.0   40000.0

In [31]:
df1.isnull().sum()

NAME      0
AGE       1
SALARY    1
dtype: int64

In [32]:
df2=d
df2.fillna(method="bfill")

      NAME   AGE    SALARY
0     Ammu  19.0   50000.0
1     Gayu  17.0  100000.0
2  Pallavi  45.0  100000.0
3    Priya  27.0   35000.0
4    Malli  27.0   40000.0